export interface Comment {
  author: string;
  content: string;
}

export interface MomentType {
  id: string;
  author: string;
  avatar: string;
  content: string;
  images: string[];
  time: string;
  likes: string[];
  comments: Comment[];
}

export const archiveMomentsData: MomentType[] = [
  {
    "id": "m_2025-12-02_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘 第一天 \n       今天学会的最重要的一课是勇敢，因为勇敢去结识他，我有了今天这篇复盘。\n       昨天在社区看到一个哥们分享他的复盘，点进朋友圈一看，没想到有人把我想做不敢做的事做了，他把复盘都发在朋友圈，于是今天加他请教了一下，果然勇敢的人先享受，说起复盘，我高考前170天就开始了，不过只是复盘每天的学习知识和自身状态，高考后我一玩就把这个习惯丢了。上大学以后我偶尔复盘，内容更多是集中在我的学习状态上，下午仔细看了他的朋友圈，进步是显而易见的，他说复盘可以量化进步，减少焦虑，这点我深有体会，总之以后我不能再断断续续地复盘了，好东西应该保持，重要的是做，不是犹豫做什么。但是注意没有完全相同的两条路，所以不可一味地学习他，要思考适不适合自己，在适合自己的基础上修改\n       看了那哥们的朋友圈，也是发现我的执行力还是不够。我因为下周考四级所以很多提升自己的事都被我拖到了考试后，因为要转专业，所以把联系学长打比赛都拖到了后面，当然理由是非常有说服力的：我要专心考试。碰巧最近在看《被讨厌的勇气》，里面的目的论恰恰说出了我不愿承认的那一面：我没有过这些经历，所以我害怕去尝试这些，基于\"想要避免\"这个目的，我就给自己找了一个完美的理由：等考完试。意识到这一点以后，我今天直接开始学着用obsidian了(我决定折中一下，学一点，又不耽误考试)，这也是我第一次尝试在朋友圈写复盘。\n        英语听力口语真的非常需要练了，我看兄弟朋友圈里\"三百计划\"不错，我也要来！\n1坚持练习听力＋口语一小时一百天\n2坚持学obsidiant，ppt，python等一百天\n3坚持发朋友圈复盘一百天\n(还有20天期末了，1和2考完再整吧哈哈哈哈这个真不拖不行)\n       最近存在一个被忽略但很重要的问题——睡眠，我有时忙到11点回宿舍，但是昨晚回去之后一个人耍手机到1点，睡眠太不规律了，不能牺牲自己的睡眠去填补白天的忙碌，以后要忙碌穿插休息，休息尽量选择散步健身小睡而不是刷抖音这种更累的活动，睡眠问题是我目前最大的问题\n       还有一些进步的点就是前几天学习并坚持了写list，按重要程度排序，前一天晚上整理好，第二天直接去做，省去选择所消耗的精力以及避免瞎忙\n       今天起把复盘捡回来了，也算是一大进步了\n加油",
    "images": [
      "/photos/2025-12-02_ori_01.webp"
    ],
    "time": "2025年12月2日 23:45",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-03_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘\n第二天\n以前的复盘总是断断续续地，今天算是正式开始的第二天咯\n今天满课\n12点放学后花40分钟做了张高数卷子。差点掉下90分(求不定积分别忘了＋c)\n下午上python\n晚上19点到21.30点处理作业，写了篇英语作文\n回宿舍后听了大川学长讲知识管理，收获良多，感觉知识管理这个概念的输入时间点恰到好处，上大学开始多方位探索以后就有了不同方面很多琐碎的知识，本来是在用原子笔记记着，正觉得有些低效，就了解到了通过obsidian搭建体系进行知识管理，记录的效率高了，不至于像短视频一样仅留下短暂的思考。\n最近忙着备考，今天写了个list，考完试要集中处理下，并整合一下最近的知识，总结一下整个学期",
    "images": [],
    "time": "2025年12月3日 23:26",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-04_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘 第三天\n      上午满课，课程已提前学过，我课上在集中处理作业，12：00—12：30对答案小小复盘了一下\n     中午跟学长交流了大学高绩点的学习方法\n     晚上跟朋友交流了我的近况，受教了，不能总是完美主义，要允许自己有些差错，允许自己偶尔打乱了计划。如果只抱着\"你必须做好，否则你就不能…\"这样反而会被自己的目标所驱使和奴役。三人行必有我师\n     下午从图书馆出来看到月亮了\n     晚上把这学期乐跑结束了\n     更正一下三百计划：\n1英语口语＋听力练习1小时一百天\n2  晚上熄灯一小时内放下手机一百天\n3  学习新技能一百天\n    睡眠太重要了",
    "images": [],
    "time": "2025年12月4日 23:57",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-05_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘 第4天\n       上午早十，起来读了十几页《被讨厌的勇气》，加深了对竞争关系与伙伴关系的理解\n        中午跟大三学长聊了一下关于读书\n        下午体育课结束后跟室友打会篮球，扭着脖子了[捂脸]\n        自学了markdown语句\n        晚上处理了一些琐碎的作业和其他事情(琐碎的事好耗费精力)\n        跟学长探讨读书的收获：每一页都很干货的书，就应该看一段内容，看到接受信息密度有些大的时候停下，然后思考之前的经历如何通过刚学到的这些理论去体现出来(内化)然后再花两天消化，通过这两天的经历用这些理论思考(输出)，几乎就这么用两天来消化勇气三部曲中的一夜，我觉得收获是非常大的。\n       分享一部分读书笔记：我们的人生坐标没有纵坐标，只有走在前面和后面我们向前走不是为了把超越某人，价值在于超越自我。良性自卑是和理想的自己相比，把人人看做伙伴，把自己看做竞争对手，才会在进步的同时，充满幸福感",
    "images": [
      "/photos/2025-12-05_ori_01.webp"
    ],
    "time": "2025年12月5日 23:55",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-07_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘  第6天\n今天早起吃了早饭\n领了衣服\n看会书了解到了\"选择消耗资源\"\n中午跟三个朋友一块参加学校体育运动嘉年华，参加几个小游戏还跑了五公里，领了奖牌\n下午睡会，改了翻译\n晚上写了一套高数题\n和化学作业\n和小j聊了很久，他教我要多体验，不要每天忙来忙去不知道在忙什么，以目标为导向多体验，受教",
    "images": [
      "/photos/2025-12-07_ori_01.webp",
      "/photos/2025-12-07_ori_02.webp"
    ],
    "time": "2025年12月7日 23:53",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-08_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘  第七天\n写了昨天剩下的高数题\n做了一套四级阅读\n跟河北小伙交流了英语学习经验\n下午练四级听力，比上次多对两道题就多了28分[捂脸]。\n晚上写了高数作业\n感冒了，吃完药好困\n不足：河南高考没考听力，三年没练过，起点有些低了，一定要坚持练听力口语\n思考：\n对那句话的理解更深刻了\"有时最深的对话，发生在言语停顿的空白里\"\n我们就是停顿的时候，我突然想起来一个重要的东西！英语学习应该是用英语思维，即不要读英语翻译成中文，再理解，这种办法学着累且不长久，之前不止一次地听到过大佬教我我要用学新语言的感觉去学，即看到cup，脑子里出来个杯子而不是看到cup，脑子里出来的是\"杯子\"这俩字，然后这俩字再转换成杯子的形状，这样看起来是没多费多少力气，但当你阅读量上来以后，你每次都比别人多了一倍流程，自然就慢了，高中意识到这一点我就开始有意识地锻炼了，高考完再学英语忘了这个事了。这对于英语学习的帮助是整体性的，一定要坚持刻意训练这种思维，四级好过，这是为了整个英语的学习。",
    "images": [],
    "time": "2025年12月8日 23:52",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-10_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第八天\n(补昨天的)\n课余背了一天政治，把六个单元都速通，提前给期末周分担压力了\n读了十几页勇气\n下面分享一段读书思考：\n今天读勇气，顿悟了两个领域知识的本质联系，和川学长交流了一下，思考更深刻了：人不可能把各个领域知识详尽地写进一本书，你读的多了，在体内发酵，塑造了整个人的气质，真正有价值的，是两本书的穿插，但你读了两本书不一定会有这个收获。阅读赋予的是工具和视角，而运用它们在自己生命的地形上探险所获得的领悟，才是无可替代的成长。",
    "images": [
      "/photos/2025-12-10_ori_01.webp"
    ],
    "time": "2025年12月10日 09:36",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-12_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今日复盘  第十一天\n今天早上前两节没课\n复习了一遍政治\n整理最近的错题\n上完三四节下大雪了\n跟几个朋友一块打雪仗，哈哈哈之前在河南好久没打那么痛快了(北方人打雪仗太狠了[捂脸]本来团队赛，有一个人倒了之后就变成群起而攻之了)\n下午通过了长拳考试\n晚上练了听力就休息了\n保证明天考试状态",
    "images": [
      "/photos/2025-12-12_ori_01.webp"
    ],
    "time": "2025年12月12日 23:08",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-26_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第十九～二十四天\n备考收官：本周密集完成了高数、线代等多门核心课程考试。有意识地训练考场心态，专注于自身节奏，几门课均发挥稳定，预估90＋\n认知迭代：针对低级错误，与大三学长展开沟通，开始从认知习惯层面建立错本进行系统纠偏。同时，在日常生活中开始尝试实践 课题分离(前几天在书上看到的理论)，将精力更聚焦于可控之事\n3行动尝试：期末备考期间，穿插了一些技能学习，包括ppt，gemini入门与应用\n期末结束，寒假将聚焦于技能学习，感觉学技能很有成就感意义感，更容易坚持下去",
    "images": [
      "/photos/2025-12-26_ori_01.webp"
    ],
    "time": "2025年12月26日 01:10",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2025-12-29_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今天回郑州了，又跟老家的朋友们聚一块了。今天愉快[耶]",
    "images": [
      "/photos/2025-12-29_ori_01.webp",
      "/photos/2025-12-29_ori_02.webp",
      "/photos/2025-12-29_ori_03.webp"
    ],
    "time": "2025年12月29日 00:24",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-02_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  25～32天\n去了郑州和开封，和朋友们聚一下回家了\n最近几天旅游给我很多机会去实践体会之前在书上读到的理论，学到很多新东西：\n实践了一个关于\"放空\"的理论\n在火车上看了《四千周》\n情景气泡理论(情景气泡的强度与互动对象的专注度和我的能见度成正比)\n学会了划船\n零和博弈认知偏差\n过几天写个年复盘，最近学校还有一些事没处理完",
    "images": [
      "/photos/2026-01-02_ori_01.webp"
    ],
    "time": "2026年1月2日 22:58",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-03_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第三十三天\n彻底完成了obsidian电脑 手机 git三端互相同步，我的知识体系搭建算是正式迈出第一步了\n补充了对课题分离的一些思考\n搭建了一套通过视频学习的流程\n本科四年是人生中边际认知成本最低的阶段，有大把的时间去搭建各个领域的基础框架，过了这段时间或许没人会等我成长了，就算我的目标仅是学术上的，我对其他方面的了解也要有一定的基础框架，这是未来跨领域连接，引起质变的关键，所以今天开始了补充世界观的计划，今天学了财商，笔记的思维导图如下图\n年度复盘会在下周一之前出，最近有些忙[玫瑰]",
    "images": [
      "/photos/2026-01-03_ori_01.webp"
    ],
    "time": "2026年1月3日 20:14",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-06_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "2025年度复盘\n2025对我完成了从高中生向大学生转变，初入大学带着许多高中思维，然而进入大学是真正的把人生全交到自己手上，我知道要攀登却不知道路在何方，幸亏遇见了照亮我的人，感恩遇见你们每一个人，每个人都教会我许多\n关于2026\n有个前辈给我讲了关于2026的趋势，颠覆认知，我也第一次接触了康波周期和美林时钟这两个经济学概念，2026是下一个康波周期的开始，2026是规则重塑的年代，以ai为中心会重塑所有工作，会有几个行业扶摇直上，不要拿现在的处境去预测未来的情况，要扩大信息渠道，提前铺设能力矩阵来保证。现在总觉时不我待，加油，期待明年此时更加丰富的进步",
    "images": [
      "/photos/2026-01-06_ori_01.webp"
    ],
    "time": "2026年1月6日 00:22",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-07_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第34~37天\n最近把年复盘写完了，一直在调整作息，现在作息已经开始早睡早起了，希望能保持\n考了一个ai证书\n录了一个英语口语视频\n又读了四千周，发现这本书不太适合我呢，书中主要是在帮大家解除忙碌，我感觉现在我挺需要忙碌的，我还在积累期，需要多打基础",
    "images": [
      "/photos/2026-01-07_ori_01.webp"
    ],
    "time": "2026年1月7日 23:12",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-13_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第38~43天\n       前几天在家状态一度下滑，变得慵懒。直到得知朋友 Lf 那哥们在校外租房与学长闭关猛攻目标，深受触动，人家起步早已遥遥领先。受此激励，这两天迅速调整策略：早睡早起，把身体扔进图书馆和自习室。环境改变了，状态自然回归。\n报名了大英赛，正在死磕听力\n考了阿里的人工智能高级训练师证书，了解越多越发觉自己的了解的太少，ai赋能给我带来的帮助是巨大的。\n最近准备做自媒体，花了一下午的时间从最素人的角度审视自己，分析了我与自媒体有关的经历，我的成长经历，粗略圈定了自媒体的定位等\n认知升级：\n       我问为什么总觉得自己时间没别人多，学长告诉我不要把时间当做线性的，一场夜谈，收获很多，包括第一性原理，1.1倍效等理论，\n       最近在反脆弱中看到一句话，深有感触，\"风熄灭蜡烛，吹旺大火\"，遭遇失败，先找战略上的问题，增强自身，而不是要否定自己。\n生活娱乐：\n看到一个主播说番茄炒蛋加番茄酱和生抽好吃，试了一下真的诶(之前真没加过生抽)\n和朋友捣鼓了半天，学会了用小蓝盾把不同地区的我们拉到一个局域网联机玩mc，欢乐，不过玩一会我就晕3D了",
    "images": [
      "/photos/2026-01-13_ori_01.webp",
      "/photos/2026-01-13_ori_02.webp",
      "/photos/2026-01-13_ori_03.webp",
      "/photos/2026-01-13_ori_04.webp"
    ],
    "time": "2026年1月13日 23:53",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-18_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第44~47天\n这几天我迈出了艰难的第一步，我要开始做自媒体了，浩源哥告诉我做自媒体和做流量视频不一样，做流量视频是为了靠流量赚钱，而做自媒体更多是写作，表达能力的锻炼与提升，保持持续的创作，不管流量好坏，带来的好处都是巨大的。\n最近几天写了很多我和自媒体的相关经历，受众分析，学了自媒体的写作系统，笔记，思考，作业加一块每天都是三千字起步，认识了很多正在学自媒体的小伙伴，每天都有人在放弃，只要我不下牌桌，我就有机会\n寒假这种长假期即可以是弯道超车的好机会又可以是滑铁卢，从高中的时候，我就开始对抗假期，尝试各种办法克制自己，大学的寒假却依然是，刷起手机就停不下来，和莫学长交流，让我收获良多，我们要戒掉廉价的快乐，追求高级的满足。压抑是反人性的，完全的禁欲是难以持久的。我们需要用高级的快乐去代替低级的快乐。当你完成了一件复杂的任务，就比如说，昨晚21点我完完整整地听下一节自媒体写作技巧课，然后开始构思写稿，24点多敲定初稿，今天9点起床喝杯咖啡开始带着学习的目光去刷我要做的方向的视频，学习他们的表达，他们的稿子的结构，刷了一个小时我就累了，然后用刚记下的东西去修改我的稿子，最后11点前完成我的第一个自媒体稿子，这种攻克难关的成就感，快乐虽然来的慢，但它深沉，持久，能够让你感到充实和自信。然后仔细品味这种感觉，让大脑记住这种感觉，从而逐渐引起短视频的喧嚣，浮躁。\n莫学长说，他是一个在喧嚣世界中追求平静的人。且将新火试新茶，诗酒趁年华",
    "images": [
      "/photos/2026-01-18_ori_01.webp"
    ],
    "time": "2026年1月18日 12:07",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-23_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第48~52天\n自媒体正式结营了，初步学习了各种系统，接下来就是不断的练习打磨了。很久之前就想做自媒体了，感谢浩哥指路。持续输出，有用有趣。\n认识了11个同赛道的朋友，有一群人一起交流学习感觉很棒\n分享最近学到的理论：\n帕金森定律：任务会自动膨胀以填满你分配的时间。也就是一个任务，你限制用多久完成，最终就会用多久完成。\n马太效应：强者愈强弱者愈弱的现象，从动力的角度说，又可以说是强者变强的道路更容易，弱者变强的阻力更大",
    "images": [
      "/photos/2026-01-23_ori_01.webp"
    ],
    "time": "2026年1月23日 15:02",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-01-28_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第五十三~五十八天\n最近慢慢调整作息，数学英语的学习慢慢回到正轨了，也做出了第一条视频\n我发现起步阶段通过模仿＋实践＋贝叶斯迭代，真的进步飞快，毕竟是能力积累阶段。\n第一条视频花了我8个小时了，不过收获很多，收获了系统打磨的各种建议，还认识了很多uu，跟一个朋友聊了能量管理，第一次听到有人用主题周这种管理方法，效果惊人，确实给我提供了一个思路，优化了一下最近的安排。能量管理重要的不是方法论，而是决策。\n跟几个友友交流了元认知，给我提供了新的视角，还学到了有关练口语的经验，认识人多点就是有好处噢。\n这些天加了30多个uu了，遇见很多优秀的朋友，最大的感受就是主动性高很重要，可以做很多有意义的事，很难想象同样一个学期，可以做那么多事。\n过年前至少需要把主业先做到立于不败之地",
    "images": [
      "/photos/2026-01-28_ori_01.webp"
    ],
    "time": "2026年1月28日 23:38",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-03_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第五十八~六十三天\n之前加的那些自媒体uu，也跟几个uu联系很多，收获很多，感觉每个人身上都有很多值得我学习的地方\n谷歌账号这几天被强制登出了，好在申诉回来了，没想到谷歌的风控这么严，以后还是需要稍加注意\n听阿文学长讲改简历，刷新认知了，简历这一块学问这么大，我还需要学习的东西太多太多了\n看了浩源哥分享的关于ai浪潮下呢未来趋势，感觉ai时代下大学教育的滞后性更加明显了，以前最多是大学教的和工作不怎么对口，几年后当ai把所有行业都冲一遍之后，大学生可能要毕业后先培训ai的应用能力才能去工作，而这个时代最大的红利是给那些主动性强的人。\n最颠覆我认知的是，主动性强的文科生在大学有更多的时间去尝试，并且对于ai应用来说，所需要的更多是统筹和策划能力，所以主动性强和心智模型高的文科生先手优势最大。\n最近又做了一期自媒体视频，拍摄过程中我发现我有点直觉型，我直接对着镜头讲能讲出很多，但坐那写稿子稿子却不太行，或许是因为刚开始什么都不会，所以感觉实践中学到的特别多，不过时间成本有些大了，虽然收到很多朋友的鼓励，但是时间成本这个问题是不能忽略的，更不能因为受到外界的完美或厌恶而改变我对自媒体下的注，记住所有活动只停留在发布，发布后的反馈只能用于提高下次的效率和质量，不能改变预估成本，不能忘记主线，下次会尝试尽量一天内完成整个流程。",
    "images": [
      "/photos/2026-02-03_ori_01.webp"
    ],
    "time": "2026年2月3日 13:03",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-09_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今天字节刚刚发布的大模型，seedance2.0，太震撼了，我以为ai生成视频还得沉淀几年，没想到seedance2.0效果这么厉害，不管是分镜，细节，声音相比之前的生成视频的大模型都大大提升，视频分镜做的很牛，因为完全没有了以前ai的那种\"为了分镜而分镜\"的感觉。我看了影视飓风的评价，他道出了一个我们不得不承认的事实，ai分镜做好了，就不需要剪辑了，或许大模型做的分镜没法完全超越人工剪辑，但它十分钟能给出上百个方案…答案很明显了…\n我本来上传照片想试一下效果，因为肖像权的原因，人脸暂时不让上传了，然后我就随便写了一句\"光头强和奶龙战斗\"短短几个字的提示词，生成的画面流畅自然，完全是电影级的，并且场景也是自动在熊出没里面取景，非常震撼，相比传统电影，如果做出的效果差不多的话，ai电影的成本更低，一部细节到位的电影只需要一个精通提示词的导演，感觉ai电影行业会兴起了。",
    "images": [
      "/photos/2026-02-09_ori_01.webp",
      "/photos/2026-02-09_ori_02.webp",
      "/photos/2026-02-09_ori_03.webp"
    ],
    "time": "2026年2月9日 23:20",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-09_02",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第 64~69 天\n       做了一期视频，限时了之后，确实效率大大提升了，目前还是以打磨系统为主，用同样的时间多尝试几次更高效\n       最近开始尝试着用X( 推特)和YouTube了，留个英语的语境挺不错的，外国的视频也挺有意思。还有grok4，这个ai感觉跟别的ai很不同，很犀利\n       这段时间最大的不足是很少成功早起，太难了，下周尽量改善。早起仅坚持一分钟，甚至后面还有深度睡眠，我太🐮了\n       前天嘴馋跑好远去吃螺蛳粉，就这大炸蛋吃着爽\n       最近突然醒悟收获的不少，在这里输出分享一部分：\n       人对道理的学习是有语境依赖性的，你听过这个道理不是你懂了，用过这个道理也不是你懂了，真的懂是需要同时懂他背后的很多道理作支撑，比如你要懂自律，就不能只懂自律，你要懂大脑，多巴胺，时间管理，习惯培养等多个方面，否则你会发现很多道理是相违的。比如\"慢就是快\"和\"完成比完美重要\"这两个道理看起来是相违的，真遇到问题时，依旧是两难困境，其本质就是因为道理的语境依赖性。你在这个语境下学会的这个道理，换个语境却不知道怎么用了，因为没有背后的道理作支撑。\n       这一点我在今天就有体会，以前我知道有个\"身份认同型习惯\"的道理，就是你心底认为自己是什么样的人，你最终就会成为什么样的人，我很久就听过这个，当时只觉得这是个用作长期培养自己的好方法，知道今天看到朋友说\"自律的第一性原理就是要身份认同，你认为自己是个不抽烟的人和你认为自己是个正在努力戒烟的人这两种情况下戒烟的难度天差地别\"我突然意识到，原来身份认同型习惯这个道理不仅可以用于长期的培养，还可以用于解决当下的问题，比如只要我潜意识认同自己就是个不熬夜的人，那我就更容易在面对微决策时做出符合我\"不熬夜人设\"的决策。很多微决策都是根据潜意识里认同的人设做出默认选项。\n       认知减法：什么都想要只会什么都得不到，最近我输入了很多很多信息，很舒服，因为感觉很充实，我做了很多事情，但是复盘时我却发现主线的权重在变小，我意识到认知应该做减法，先攒一定的量，再提纯求质，再去攒量，而不是去贪量。我确实做了很多对我以后都有益处的事，但不能因此忘了眼前，所以还是要以眼前在做的为主\np1 早起一分钟后陷入深度睡眠\np2 大炸弹特写\np3 话糙理不糙",
    "images": [
      "/photos/2026-02-09_ori_01.webp",
      "/photos/2026-02-09_ori_02.webp",
      "/photos/2026-02-09_ori_03.webp"
    ],
    "time": "2026年2月9日 02:38",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-10_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "这个寒假死在我手上的第6个柚子",
    "images": [
      "/photos/2026-02-10_ori_01.webp"
    ],
    "time": "2026年2月10日 22:31",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-13_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第 70~73 天\n出了一期视频，终于做出一期数据不错的视频了，感觉安心了很多哈哈哈\n注册了一个公众号，不过最近不打算发文章，没太多精力\n今晚由峰哥带着，实操trae体验了了一把vibe coding，体会很多。复盘历史的康波周期，每个时代都是一个康波周期，且会有一个象征性的烙印。就像是第一次康波周期，蒸汽机出现，工厂开始取代手工，蒸汽机的研发者都吃到了开创时代的第一波红利，但对于大多数人来说，真正的机会窗口往往属于率先把蒸汽机用到生产，纺织各个方面的人，在互联网出现的时代，所有东西都开始连上互联网，真正塑造新格局的也是那些率先把互联网应用在各个方面的实业家。\n最近最开心的收获是连着两天超额完成任务，早睡早起，作息慢慢调回来了(今天复盘太久了又熬夜了[捂脸])，不过节奏很舒服\n亲爱的老爸今天到家，昨天把房间都里里外外打扫了一遍，干干净净舒舒服服",
    "images": [
      "/photos/2026-02-13_ori_01.webp"
    ],
    "time": "2026年2月13日 00:33",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-17_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "好久没有这么开心地打游戏了，老朋友靠游戏重聚在一起，就这样一直聊天，不用看手机里的待办备忘录，不用管今天没完成的任务，不用管明天是否能早起，只需要和平时没时间聚的朋友们聊天，不用聊未来，聊现在，就只要聊聊那些过去被无数次翻出过的的往事。\n我也不知道为啥图上是龙年大吉哈哈哈，刷出来去年的五排头像了",
    "images": [
      "/photos/2026-02-17_ori_01.webp",
      "/photos/2026-02-17_ori_02.webp"
    ],
    "time": "2026年2月17日 00:00",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-22_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "今天无意间解答了自己第一次用ai编程遇到的问题——为什么花一个小时能很容易地做出框架，后面修改一点细节却花了六七个小时？\n这是我在生成视频时发现的，似乎越是细节的内容越难生成准确，后来了解到，对于生成式的ai，如果把生成目标比作一个系统，系统有很多变量组成，你的目标越宏大/模糊，比如\"生成一段星际大战的视频\"，他的解向量是非常多的，有很多发挥空间，但是你要是让他\"生成一段xx视频，(细节的要求)×10\"他一定会有很多细节出错，因为符合要求的系统，的解向量很少，甚至可能只有一个。但是变量太多了，他一定出错。\n生成式ai精于从0到1的宏大生成，却拙于从1到1.1的精准微调\n一周前，seedance2.0发布，我体验后觉得ai电影已经可以踏上历史舞台了，现在看来又有了新的体会，对于一闪而过的，为了体现视觉冲击力的场景，ai生成的效率是＞大量人工手搓的，但对于追求跟内容深度联系的，体现小巧思的细节部分，调教ai提示词的那段时间真不如手搓了",
    "images": [
      "/photos/2026-02-22_ori_01.webp"
    ],
    "time": "2026年2月22日 20:33",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-02-25_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第 76~85 天\n现在已经在离乡返校的火车上了\n总结了一下这几天的复盘。过年，走亲戚，玩舒服了，和爸妈在家聊天，吃饭，看了几部电影，跟朋友聚餐，打球，ktv。\n这几天没怎么学习，有时间就在整理整个寒假的收获，提取一些核心出来，还提前构思了几篇稿子，做几个预制的哈哈哈，方便三月集中精力解决眼前的事",
    "images": [],
    "time": "2026年2月25日 12:02",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-03-12_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "香迷糊了",
    "images": [
      "/photos/2026-03-12_ori_01.webp",
      "/photos/2026-03-12_ori_02.webp",
      "/photos/2026-03-12_ori_03.webp"
    ],
    "time": "2026年3月12日 12:26",
    "likes": [
      "29"
    ],
    "comments": []
  },
  {
    "id": "m_2026-03-20_01",
    "author": "29",
    "avatar": "/images/头像.jpg",
    "content": "复盘  第86~108天\n草草算了一下，这两天输出万字了，原来表达枯竭了是这种感觉…复盘面试和备考还有各种提示词，收获很多，在此也输出一部分\n1,注意力\n我时常会想，别人都说年轻人最不缺时间，为什么我还是觉得时间不够用？20天的备考让我发现，注意力才是最宝贵的资产。高效的时间管理本质上是注意力的管理。时间从来都不是问题的本质，真正的问题是我在把注意力放在低质量的时间上。特别是处在信息碎片化时代，信息越多注意力就越少，昨天看到博哥说他的时间管理逻辑是罗列出必须要做的事情，然后把时间块排好，空余时间再插入些不那么着急的事情。这其实是把注意力提前规划给那些重要的事。当注意力被耗尽时，即使有时间也是低效地浪费。\n2,待办\n结合上面谈的注意力，我在准备转专业考试期间，为了保护自己的注意力资源，也会把对考试没直接帮助且不着急的事都扔到待办文件夹里了，我只会在一天注意力资源用完后，挑一些我特别感兴趣的处理一下。这种方式让我有了极其高效的备考节奏。考完以后实践发现前面留了很多舒适圈之外的待办，比如仅仅优化网站和龙虾这两个简直是时间黑洞，给我gemini用限额三次了…全力处理ing\n3,最大的收获是认知减负\n还是那句话，在忙不过来的时候，要先立于不败之地，不是要一定取胜，而是把首要目标做好，慢慢取胜。\n4,\n考完试回到宿舍，我就迫不及待地本地部署了这个小龙虾，从浩哥那学到一种用法，把具体的数据以及灵感发给龙虾存为各种库，龙虾自己根据灵感库检索，基于数据库给出爆款方向，我创作的视频越多，龙虾就越精确好用，准备这两天就把这个整出来。终于把我的简历网站2.0做出来了，至少够用一段时间了\n5,小幸运\n室友们知道我俩要考试，这周我们宿舍睡觉第一早[月亮]\n吴姐每天都跟我讲当天的大概直播内容方便我做规划决策，感动[流泪]\np1,刚面完试就回来写了四千字\np2,记录我的龙虾刚刚出生\np3,世上竟有菠萝炒饭，味道不错就是有点shuan\np4,学校水管漏水＋夜里温度低，感觉很特别",
    "images": [
      "/photos/2026-03-20_ori_01.webp",
      "/photos/2026-03-20_ori_02.webp",
      "/photos/2026-03-20_ori_03.webp",
      "/photos/2026-03-20_ori_04.webp"
    ],
    "time": "2026年3月20日 00:36",
    "likes": [
      "29"
    ],
    "comments": [
      {
        "author": "29",
        "content": "转专业结果过两天公布"
      }
    ]
  },
  {
    "id": "special-contact-moment",
    "author": "我",
    "avatar": "/images/头像.jpg",
    "content": "联系我请点这里",
    "time": "2007年7月16日 10:00",
    "images": [],
    "likes": [],
    "comments": []
  }
];
